lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "WDOGVALUE" -->
        <register>
          <name>WDOGVALUE</name>
          <description>Software Watchdog Timer Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "WDOGCONTROL" -->
        <register>
          <name>WDOGCONTROL</name>
          <description>Software Watchdog Timer Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SPM" -->
            <field>
              <name>SPM</name>
              <description>Software Watchdog window watchdog mode enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TWD" -->
            <field>
              <name>TWD</name>
              <description>Timing window setting bit of the software watchdog</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RESEN" -->
            <field>
              <name>RESEN</name>
              <description>Reset enable bit of the software watchdog</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTEN" -->
            <field>
              <name>INTEN</name>
              <description>Interrupt and counter enable bit of the software watchdog </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WDOGINTCLR" -->
        <register>
          <name>WDOGINTCLR</name>
          <description>Software Watchdog Timer Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "WDOGRIS" -->
        <register>
          <name>WDOGRIS</name>
          <description>Software Watchdog Timer Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RIS" -->
            <field>
              <name>RIS</name>
              <description>Software watchdog interrupt status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WDOGSPMC" -->
        <register>
          <name>WDOGSPMC</name>
          <description>Software Watchdog Timer Window Watchdog Mode Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TGR" -->
            <field>
              <name>TGR</name>
              <description>Software watchdog trigger type bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WDOGLOCK" -->
        <register>
          <name>WDOGLOCK</name>
          <description>Software Watchdog Timer Lock Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DTIM" -->
    <peripheral>
      <name>DTIM</name>
      <description>Dual Timer</description>
      <version>A</version>
      <groupName>DTIM</groupName>
      <baseAddress>0x40015000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "DT1_2" -->
      <interrupt>
        <name>DT1_2</name>
        <value>47</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "TIMER1LOAD" -->
        <register>
          <name>TIMER1LOAD</name>
          <description>Load Register</description>
          <alternateGroup>DualTimer1</alternateGroup>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER1VALUE" -->
        <register>
          <name>TIMER1VALUE</name>
          <description>Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER1CONTROL" -->
        <register>
          <name>TIMER1CONTROL</name>
          <description>Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000EF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TimerEn" -->
            <field>
              <name>TimerEn</name>
              <description>Enable bit </description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TimerMode" -->
            <field>
              <name>TimerMode</name>
              <description>Mode bit </description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IntEnable" -->
            <field>
              <name>IntEnable</name>
              <description>Interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TimerPre" -->
            <field>
              <name>TimerPre</name>
              <description>Prescale bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TimerSize" -->
            <field>
              <name>TimerSize</name>
              <description>Counter size bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OneShot" -->
            <field>
              <name>OneShot</name>
              <description>One-shot mode bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
