lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "ODDPKS1" -->
        <register>
          <name>ODDPKS1</name>
          <description>USB ch.1 Odd Packet Size DMA Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ODDPKS14" -->
            <field>
              <name>ODDPKS14</name>
              <description>"If the transfer destination address of DMAC is USB.EP5DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS13" -->
            <field>
              <name>ODDPKS13</name>
              <description>"If the transfer destination address of DMAC is USB.EP4DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS12" -->
            <field>
              <name>ODDPKS12</name>
              <description>"If the transfer destination address of DMAC is USB.EP3DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS11" -->
            <field>
              <name>ODDPKS11</name>
              <description>"If the transfer destination address of DMAC is USB.EP2DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS10" -->
            <field>
              <name>ODDPKS10</name>
              <description>"If the transfer destination address of DMAC is USB.EP1DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ003SEL" -->
        <register>
          <name>IRQ003SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ003)</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Interrupt source is moved to bit of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ004SEL" -->
        <register>
          <name>IRQ004SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ004)</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Interrupt source is moved to bit of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ005SEL" -->
        <register>
          <name>IRQ005SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ005)</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Interrupt source is moved to bit of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ006SEL" -->
        <register>
          <name>IRQ006SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ006)</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT" -->
            <field>
              <name>SELBIT</name>
              <description>Interrupt source is moved to bit of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
