lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "UPCR2" -->
        <register>
          <name>UPCR2</name>
          <description>USB-PLL Control Register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPOWT" -->
            <field>
              <name>UPOWT</name>
              <description>USB-PLL oscillation stabilization wait time setting bit</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR3" -->
        <register>
          <name>UPCR3</name>
          <description>USB-PLL Control Register 3</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLK" -->
            <field>
              <name>UPLLK</name>
              <description>Frequency division ratio (K) setting bit of the USB-PLL clock </description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR4" -->
        <register>
          <name>UPCR4</name>
          <description>USB-PLL Control Register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3B</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLN" -->
            <field>
              <name>UPLLN</name>
              <description>Frequency division ratio (N) setting bit of the USB-PLL clock </description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR5" -->
        <register>
          <name>UPCR5</name>
          <description>USB-PLL Control Register 5</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLM" -->
            <field>
              <name>UPLLM</name>
              <description>Frequency division ratio (M) setting bit of the USB-PLL clock</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UP_STR" -->
        <register>
          <name>UP_STR</name>
          <description>USB-PLL Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPRDY" -->
            <field>
              <name>UPRDY</name>
              <description>USB-PLL oscillation stabilization bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_ENR" -->
        <register>
          <name>UPINT_ENR</name>
          <description>USB-PLL Interrupt Factor Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSE" -->
            <field>
              <name>UPCSE</name>
              <description>USB-PLL oscillation stabilization wait complete interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_STR" -->
        <register>
          <name>UPINT_STR</name>
          <description>USB-PLL Interrupt Factor Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSI" -->
            <field>
              <name>UPCSI</name>
              <description>USB-PLL interrupt factor status bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_CLR" -->
        <register>
          <name>UPINT_CLR</name>
          <description>USB-PLL Interrupt Factor Clear Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSC" -->
            <field>
              <name>UPCSC</name>
              <description>USB-PLL oscillation stabilization interrupt factor clear bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "USBEN0" -->
        <register>
          <name>USBEN0</name>
          <description>USB0 Enable Register</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USBEN0" -->
            <field>
              <name>USBEN0</name>
              <description>USB0 enable bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
