lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "DDR7" -->
        <register derivedFrom="PFR7">
          <name>DDR7</name>
          <description>Port input/output Direction Setting Register 7</description>
          <addressOffset>0x21C</addressOffset>
        </register>
        <!-- REGISTER "DDR8" -->
        <register derivedFrom="PFR8">
          <name>DDR8</name>
          <description>Port input/output Direction Setting Register 8</description>
          <addressOffset>0x220</addressOffset>
        </register>
        <!-- REGISTER "DDR9" -->
        <register derivedFrom="PFR9">
          <name>DDR9</name>
          <description>Port input/output Direction Setting Register 9</description>
          <addressOffset>0x224</addressOffset>
        </register>
        <!-- REGISTER "DDRA" -->
        <register derivedFrom="PFRA">
          <name>DDRA</name>
          <description>Port input/output Direction Setting Register A</description>
          <addressOffset>0x228</addressOffset>
        </register>
        <!-- REGISTER "DDRB" -->
        <register derivedFrom="PFRB">
          <name>DDRB</name>
          <description>Port input/output Direction Setting Register B</description>
          <addressOffset>0x22C</addressOffset>
        </register>
        <!-- REGISTER "DDRC" -->
        <register derivedFrom="PFRC">
          <name>DDRC</name>
          <description>Port input/output Direction Setting Register C</description>
          <addressOffset>0x230</addressOffset>
        </register>
        <!-- REGISTER "DDRD" -->
        <register derivedFrom="PFRD">
          <name>DDRD</name>
          <description>Port input/output Direction Setting Register D</description>
          <addressOffset>0x234</addressOffset>
        </register>
        <!-- REGISTER "DDRE" -->
        <register derivedFrom="PFRE">
          <name>DDRE</name>
          <description>Port input/output Direction Setting Register E</description>
          <addressOffset>0x238</addressOffset>
        </register>
        <!-- REGISTER "DDRF" -->
        <register derivedFrom="PFRF">
          <name>DDRF</name>
          <description>Port input/output Direction Setting Register F</description>
          <addressOffset>0x23C</addressOffset>
        </register>
        <!-- REGISTER "PDIR0" -->
        <register derivedFrom="DDR0">
          <name>PDIR0</name>
          <description>Port Input Data Register 0</description>
          <addressOffset>0x300</addressOffset>
        </register>
        <!-- REGISTER "PDIR1" -->
        <register derivedFrom="DDR1">
          <name>PDIR1</name>
          <description>Port Input Data Register 1</description>
          <addressOffset>0x304</addressOffset>
        </register>
        <!-- REGISTER "PDIR2" -->
        <register derivedFrom="DDR2">
          <name>PDIR2</name>
          <description>Port Input Data Register 2</description>
          <addressOffset>0x308</addressOffset>
        </register>
        <!-- REGISTER "PDIR3" -->
        <register derivedFrom="DDR3">
          <name>PDIR3</name>
          <description>Port Input Data Register 3</description>
          <addressOffset>0x30C</addressOffset>
        </register>
        <!-- REGISTER "PDIR4" -->
        <register derivedFrom="DDR4">
          <name>PDIR4</name>
          <description>Port Input Data Register 4</description>
          <addressOffset>0x310</addressOffset>
        </register>
        <!-- REGISTER "PDIR5" -->
        <register derivedFrom="DDR5">
          <name>PDIR5</name>
          <description>Port Input Data Register 5</description>
          <addressOffset>0x314</addressOffset>
        </register>
        <!-- REGISTER "PDIR6" -->
        <register derivedFrom="DDR6">
          <name>PDIR6</name>
          <description>Port Input Data Register 6</description>
          <addressOffset>0x318</addressOffset>
        </register>
        <!-- REGISTER "PDIR7" -->
        <register derivedFrom="DDR7">
          <name>PDIR7</name>
          <description>Port Input Data Register 7</description>
          <addressOffset>0x31C</addressOffset>
        </register>
        <!-- REGISTER "PDIR8" -->
        <register derivedFrom="DDR8">
          <name>PDIR8</name>
          <description>Port Input Data Register 8</description>
          <addressOffset>0x320</addressOffset>
        </register>
        <!-- REGISTER "PDIR9" -->
        <register derivedFrom="DDR9">
          <name>PDIR9</name>
          <description>Port Input Data Register 9</description>
          <addressOffset>0x324</addressOffset>
        </register>
        <!-- REGISTER "PDIRA" -->
        <register derivedFrom="DDRA">
          <name>PDIRA</name>
          <description>Port Input Data Register A</description>
          <addressOffset>0x328</addressOffset>
        </register>
        <!-- REGISTER "PDIRB" -->
        <register derivedFrom="DDRB">
          <name>PDIRB</name>
          <description>Port Input Data Register B</description>
          <addressOffset>0x32C</addressOffset>
        </register>
        <!-- REGISTER "PDIRC" -->
        <register derivedFrom="DDRC">
          <name>PDIRC</name>
          <description>Port Input Data Register C</description>
          <addressOffset>0x330</addressOffset>
        </register>
        <!-- REGISTER "PDIRD" -->
        <register derivedFrom="DDRD">
          <name>PDIRD</name>
          <description>Port Input Data Register D</description>
          <addressOffset>0x334</addressOffset>
        </register>
        <!-- REGISTER "PDIRE" -->
        <register derivedFrom="DDRE">
          <name>PDIRE</name>
          <description>Port Input Data Register E</description>
          <addressOffset>0x338</addressOffset>
        </register>
        <!-- REGISTER "PDIRF" -->
        <register derivedFrom="DDRF">
          <name>PDIRF</name>
          <description>Port Input Data Register F</description>
          <addressOffset>0x33C</addressOffset>
        </register>
        <!-- REGISTER "PDOR0" -->
        <register derivedFrom="DDR0">
          <name>PDOR0</name>
          <description>Port Output Data Register 0</description>
          <addressOffset>0x400</addressOffset>
        </register>
