lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "EPFR11" -->
        <register>
          <name>EPFR11</name>
          <description>Extended Pin Function Setting Register 11</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UERLC" -->
            <field>
              <name>UERLC</name>
              <description>UERLC relocation select bit</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED15B" -->
            <field>
              <name>UED15B</name>
              <description>UED15B Input/Output Select bit</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED14B" -->
            <field>
              <name>UED14B</name>
              <description>UED14B Input/Output Select bit</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED13B" -->
            <field>
              <name>UED13B</name>
              <description>UED13B Input/Output Select bit</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED12B" -->
            <field>
              <name>UED12B</name>
              <description>UED12B Input/Output Select bit</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED11B" -->
            <field>
              <name>UED11B</name>
              <description>UED11B Input/Output Select bit</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED10B" -->
            <field>
              <name>UED10B</name>
              <description>UED10B Input/Output Select bit</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED09B" -->
            <field>
              <name>UED09B</name>
              <description>UED09B Input/Output Select bit</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED08B" -->
            <field>
              <name>UED08B</name>
              <description>UED08B Input/Output Select bit</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED07B" -->
            <field>
              <name>UED07B</name>
              <description>UED07B Input/Output Select bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED06B" -->
            <field>
              <name>UED06B</name>
              <description>UED06B Input/Output Select bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED05B" -->
            <field>
              <name>UED05B</name>
              <description>UED05B Input/Output Select bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED04B" -->
            <field>
              <name>UED04B</name>
              <description>UED04B Input/Output Select bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED03B" -->
            <field>
              <name>UED03B</name>
              <description>UED03B Input/Output Select bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED02B" -->
            <field>
              <name>UED02B</name>
              <description>UED02B Input/Output Select bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED01B" -->
            <field>
              <name>UED01B</name>
              <description>UED01B Input/Output Select bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED00B" -->
            <field>
              <name>UED00B</name>
              <description>UED00B Input/Output Select bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA07E" -->
            <field>
              <name>UEA07E</name>
              <description>UEA07E Output Select bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA06E" -->
            <field>
              <name>UEA06E</name>
              <description>UEA06E Output Select bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA05E" -->
            <field>
              <name>UEA05E</name>
              <description>UEA05E Output Select bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA04E" -->
            <field>
              <name>UEA04E</name>
              <description>UEA04E Output Select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA03E" -->
            <field>
              <name>UEA03E</name>
              <description>UEA03E Output Select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA02E" -->
            <field>
              <name>UEA02E</name>
              <description>UEA02E Output Select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA01E" -->
            <field>
              <name>UEA01E</name>
              <description>UEA01E Output Select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS0E" -->
            <field>
              <name>UECS0E</name>
              <description>UEA00E Output Select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEALEE" -->
            <field>
              <name>UEALEE</name>
              <description>UEALEE Output Select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR12" -->
        <register>
          <name>EPFR12</name>
          <description>Extended Pin Function Setting Register 12</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR13" -->
        <register>
          <name>EPFR13</name>
          <description>Extended Pin Function Setting Register 13</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR14" -->
        <register>
          <name>EPFR14</name>
          <description>Extended Pin Function Setting Register 14</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR15" -->
        <register>
          <name>EPFR15</name>
          <description>Extended Pin Function Setting Register 15</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
