lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "EPFR16" -->
        <register>
          <name>EPFR16</name>
          <description>Extended Pin Function Setting Register 16</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SFMPBC" -->
            <field>
              <name>SFMPBC</name>
              <description>MFS ch.B I2C FastMode+ Select bit</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SFMPAC" -->
            <field>
              <name>SFMPAC</name>
              <description>MFS ch.A I2C FastMode+ Select bit</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS7B" -->
            <field>
              <name>SCS7B</name>
              <description>SCS7 Input/Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS6B" -->
            <field>
              <name>SCS6B</name>
              <description>SCS6 Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR17" -->
        <register>
          <name>EPFR17</name>
          <description>Extended Pin Function Setting Register 17</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR18" -->
        <register>
          <name>EPFR18</name>
          <description>Extended Pin Function Setting Register 18</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFC000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDWPS" -->
            <field>
              <name>SDWPS</name>
              <description>S_WP input select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCDS" -->
            <field>
              <name>SDCDS</name>
              <description>S_CD input select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA3B" -->
            <field>
              <name>SDDATA3B</name>
              <description>S_CD input select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA2B" -->
            <field>
              <name>SDDATA2B</name>
              <description>S_CD input select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA1B" -->
            <field>
              <name>SDDATA1B</name>
              <description>S_CD input select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA0B" -->
            <field>
              <name>SDDATA0B</name>
              <description>S_CD input select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCMDB" -->
            <field>
              <name>SDCMDB</name>
              <description>S_CMD input/output select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCLKE" -->
            <field>
              <name>SDCLKE</name>
              <description>S_CLK output select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR19" -->
        <register>
          <name>EPFR19</name>
          <description>Extended Pin Function Setting Register 19</description>
          <addressOffset>0x64C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR20" -->
        <register>
          <name>EPFR20</name>
          <description>Extended Pin Function Setting Register 20</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UECSXE" -->
            <field>
              <name>UECSXE</name>
              <description>UECSXE output select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDWEXE" -->
            <field>
              <name>UEDWEXE</name>
              <description>UEDWEXE output select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECASE" -->
            <field>
              <name>UECASE</name>
              <description>UECASE output select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UERASE" -->
            <field>
              <name>UERASE</name>
              <description>UERASE output select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UESMCEE" -->
            <field>
              <name>UESMCEE</name>
              <description>UESMCEE output select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UESMCKE" -->
            <field>
              <name>UESMCKE</name>
              <description>UESMCKE output select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR21" -->
        <register>
          <name>EPFR21</name>
          <description>Extended Pin Function Setting Register 21</description>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR22" -->
        <register>
          <name>EPFR22</name>
          <description>Extended Pin Function Setting Register 22</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR23" -->
        <register>
          <name>EPFR23</name>
          <description>Extended Pin Function Setting Register 23</description>
          <addressOffset>0x65C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000303</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCS70E" -->
            <field>
              <name>SCS70E</name>
              <description>SCS70 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS60E" -->
            <field>
              <name>SCS60E</name>
              <description>SCS60 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR24" -->
        <register>
          <name>EPFR24</name>
          <description>Extended Pin Function Setting Register 24</description>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "I2SM4_SDO1E" -->
            <field>
              <name>I2SM4_SDO1E</name>
              <description>I2SDO1 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_SDI1S" -->
            <field>
              <name>I2SM4_SDI1S</name>
              <description>I2SDI1 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_WS1B" -->
            <field>
              <name>I2SM4_WS1B</name>
              <description>I2SWS1 Input/Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_SCK1B" -->
            <field>
              <name>I2SM4_SCK1B</name>
              <description>I2SCK1 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_MCLK1E" -->
            <field>
              <name>I2SM4_MCLK1E</name>
              <description>I2SMCLK1 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_MCLK1S" -->
            <field>
              <name>I2SM4_MCLK1S</name>
              <description>I2SMCLK1 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_SDO0E" -->
            <field>
              <name>I2SM4_SDO0E</name>
              <description>I2SDO0 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_SDI0S" -->
            <field>
              <name>I2SM4_SDI0S</name>
              <description>I2SDI0 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_WS0B" -->
            <field>
              <name>I2SM4_WS0B</name>
              <description>I2SWS0 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_SCK0B" -->
            <field>
              <name>I2SM4_SCK0B</name>
              <description>I2SCK0 Input/Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_MCLK0E" -->
            <field>
              <name>I2SM4_MCLK0E</name>
              <description>I2SMCLK0 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SM4_MCLK0S" -->
            <field>
              <name>I2SM4_MCLK0S</name>
              <description>I2SMCLK0 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR25" -->
        <register>
          <name>EPFR25</name>
          <description>Extended Pin Function Setting Register 25</description>
          <addressOffset>0x664</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MCTX2E" -->
            <field>
              <name>MCTX2E</name>
              <description>TX2 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCRX2S" -->
            <field>
              <name>MCRX2S</name>
              <description>RX2 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR26" -->
        <register>
          <name>EPFR26</name>
          <description>Extended Pin Function Setting Register 26</description>
          <addressOffset>0x668</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FC0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "Q_IO3B" -->
            <field>
              <name>Q_IO3B</name>
              <description>Q_IO3 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Q_IO2B" -->
            <field>
              <name>Q_IO2B</name>
              <description>Q_IO2 Input Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Q_IO1B" -->
            <field>
              <name>Q_IO1B</name>
              <description>Q_IO1 Input Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Q_IO0B" -->
            <field>
              <name>Q_IO0B</name>
              <description>Q_IO0 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Q_CS0E" -->
            <field>
              <name>Q_CS0E</name>
              <description>Q_CS0 Input Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Q_SCKB" -->
            <field>
              <name>Q_SCKB</name>
              <description>Q_SCK Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
