lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "TOCC" -->
        <register>
          <name>TOCC</name>
          <description>Timeout Counter Configuration</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TOP" -->
            <field>
              <name>TOP</name>
              <description>Timeout Period</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOS" -->
            <field>
              <name>TOS</name>
              <description>Timeout Select</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ETOC" -->
            <field>
              <name>ETOC</name>
              <description>Enable Timeout Counter</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TOCV" -->
        <register>
          <name>TOCV</name>
          <description>Timeout Counter Value</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TOC" -->
            <field>
              <name>TOC</name>
              <description>Timeout Counter</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ECR" -->
        <register>
          <name>ECR</name>
          <description>Error Counter Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CEL" -->
            <field>
              <name>CEL</name>
              <description>CAN Error Logging</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RP" -->
            <field>
              <name>RP</name>
              <description>Receive Error Passive</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description>Receive Error Counter</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TEC" -->
            <field>
              <name>TEC</name>
              <description>Transmit Error Counter</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSR" -->
        <register>
          <name>PSR</name>
          <description>Protocol Status Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000707</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REDL" -->
            <field>
              <name>REDL</name>
              <description>Received a CAN FD Message</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RBRS" -->
            <field>
              <name>RBRS</name>
              <description>BRS flag of last received CAN FD Message</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RESI" -->
            <field>
              <name>RESI</name>
              <description>ESI flag of last received CAN FD Message</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLEC" -->
            <field>
              <name>FLEC</name>
              <description>Fast Last Error Code</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BO" -->
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EW" -->
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EP" -->
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACT" -->
            <field>
              <name>ACT</name>
              <description>Activity</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LEC" -->
            <field>
              <name>LEC</name>
              <description>Last Error Code</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IR" -->
        <register>
          <name>IR</name>
          <description>Interrupt Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STE" -->
            <field>
              <name>STE</name>
              <description>Stuff Error</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FOE" -->
            <field>
              <name>FOE</name>
              <description>Format Error</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKE" -->
            <field>
              <name>ACKE</name>
              <description>Acknowledge Error</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description>Bit Error</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCE" -->
            <field>
              <name>CRCE</name>
              <description>CRC Error</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDI" -->
            <field>
              <name>WDI</name>
              <description>Watchdog Interrupt</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BO" -->
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EW" -->
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EP" -->
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ELO" -->
            <field>
              <name>ELO</name>
              <description>Error Logging Overflow</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEU" -->
            <field>
              <name>BEU</name>
              <description>Bit Error Uncorrected</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description>Bit Error Corrected</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRX" -->
            <field>
              <name>DRX</name>
              <description>Message stored to Dedicated Rx Buffer</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOO" -->
            <field>
              <name>TOO</name>
              <description>Timeout Occurred</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MRAF" -->
            <field>
              <name>MRAF</name>
              <description>Message RAM Access Failure</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSW" -->
            <field>
              <name>TSW</name>
              <description>Timestamp Wraparound</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFL" -->
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFF" -->
            <field>
              <name>TEFF</name>
              <description>Tx Event FIFO Full</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFW" -->
            <field>
              <name>TEFW</name>
              <description>Tx Event FIFO Watermark Reached</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFN" -->
            <field>
              <name>TEFN</name>
              <description>Tx Event FIFO New Entry</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFE" -->
            <field>
              <name>TFE</name>
              <description>Tx FIFO Empty</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCF" -->
            <field>
              <name>TCF</name>
              <description>Transmission Cancellation Finished</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description>Transmission Completed</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPM" -->
            <field>
              <name>HPM</name>
              <description>High Priority Message</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1L" -->
            <field>
              <name>RF1L</name>
              <description>Rx FIFO 1 Message Lost</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1F" -->
            <field>
              <name>RF1F</name>
              <description>Rx FIFO 1 Full</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1W" -->
            <field>
              <name>RF1W</name>
              <description>Rx FIFO 1 Watermark Reached</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1N" -->
            <field>
              <name>RF1N</name>
              <description>Rx FIFO 1 New Message</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0L" -->
            <field>
              <name>RF0L</name>
              <description>Rx FIFO 0 Message Lost</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0F" -->
            <field>
              <name>RF0F</name>
              <description>Rx FIFO 0 Full</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0W" -->
            <field>
              <name>RF0W</name>
              <description>Rx FIFO 0 Watermark Reached</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0N" -->
            <field>
              <name>RF0N</name>
              <description>Rx FIFO 0 New Message</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
