lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "TXBCR" -->
        <register>
          <name>TXBCR</name>
          <description>Tx Buffer Cancellation Request</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CR31" -->
            <field>
              <name>CR31</name>
              <description>Cancellation Request of Tx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR30" -->
            <field>
              <name>CR30</name>
              <description>Cancellation Request of Tx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR29" -->
            <field>
              <name>CR29</name>
              <description>Cancellation Request of Tx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR28" -->
            <field>
              <name>CR28</name>
              <description>Cancellation Request of Tx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR27" -->
            <field>
              <name>CR27</name>
              <description>Cancellation Request of Tx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR26" -->
            <field>
              <name>CR26</name>
              <description>Cancellation Request of Tx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR25" -->
            <field>
              <name>CR25</name>
              <description>Cancellation Request of Tx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR24" -->
            <field>
              <name>CR24</name>
              <description>Cancellation Request of Tx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR23" -->
            <field>
              <name>CR23</name>
              <description>Cancellation Request of Tx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR22" -->
            <field>
              <name>CR22</name>
              <description>Cancellation Request of Tx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR21" -->
            <field>
              <name>CR21</name>
              <description>Cancellation Request of Tx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR20" -->
            <field>
              <name>CR20</name>
              <description>Cancellation Request of Tx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR19" -->
            <field>
              <name>CR19</name>
              <description>Cancellation Request of Tx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR18" -->
            <field>
              <name>CR18</name>
              <description>Cancellation Request of Tx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR17" -->
            <field>
              <name>CR17</name>
              <description>Cancellation Request of Tx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR16" -->
            <field>
              <name>CR16</name>
              <description>Cancellation Request of Tx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR15" -->
            <field>
              <name>CR15</name>
              <description>Cancellation Request of Tx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR14" -->
            <field>
              <name>CR14</name>
              <description>Cancellation Request of Tx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR13" -->
            <field>
              <name>CR13</name>
              <description>Cancellation Request of Tx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR12" -->
            <field>
              <name>CR12</name>
              <description>Cancellation Request of Tx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR11" -->
            <field>
              <name>CR11</name>
              <description>Cancellation Request of Tx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR10" -->
            <field>
              <name>CR10</name>
              <description>Cancellation Request of Tx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR9" -->
            <field>
              <name>CR9</name>
              <description>Cancellation Request of Tx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR8" -->
            <field>
              <name>CR8</name>
              <description>Cancellation Request of Tx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR7" -->
            <field>
              <name>CR7</name>
              <description>Cancellation Request of Tx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR6" -->
            <field>
              <name>CR6</name>
              <description>Cancellation Request of Tx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR5" -->
            <field>
              <name>CR5</name>
              <description>Cancellation Request of Tx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR4" -->
            <field>
              <name>CR4</name>
              <description>Cancellation Request of Tx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR3" -->
            <field>
              <name>CR3</name>
              <description>Cancellation Request of Tx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR2" -->
            <field>
              <name>CR2</name>
              <description>Cancellation Request of Tx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR1" -->
            <field>
              <name>CR1</name>
              <description>Cancellation Request of Tx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR0" -->
            <field>
              <name>CR0</name>
              <description>Cancellation Request of Tx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBTO" -->
        <register>
          <name>TXBTO</name>
          <description>Tx Buffer Transmission Occurred</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TO31" -->
            <field>
              <name>TO31</name>
              <description>Transmission Occurred of Tx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO30" -->
            <field>
              <name>TO30</name>
              <description>Transmission Occurred of Tx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO29" -->
            <field>
              <name>TO29</name>
              <description>Transmission Occurred of Tx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO28" -->
            <field>
              <name>TO28</name>
              <description>Transmission Occurred of Tx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO27" -->
            <field>
              <name>TO27</name>
              <description>Transmission Occurred of Tx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO26" -->
            <field>
              <name>TO26</name>
              <description>Transmission Occurred of Tx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO25" -->
            <field>
              <name>TO25</name>
              <description>Transmission Occurred of Tx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO24" -->
            <field>
              <name>TO24</name>
              <description>Transmission Occurred of Tx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO23" -->
            <field>
              <name>TO23</name>
              <description>Transmission Occurred of Tx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO22" -->
            <field>
              <name>TO22</name>
              <description>Transmission Occurred of Tx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO21" -->
            <field>
              <name>TO21</name>
              <description>Transmission Occurred of Tx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO20" -->
            <field>
              <name>TO20</name>
              <description>Transmission Occurred of Tx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO19" -->
            <field>
              <name>TO19</name>
              <description>Transmission Occurred of Tx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO18" -->
            <field>
              <name>TO18</name>
              <description>Transmission Occurred of Tx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO17" -->
            <field>
              <name>TO17</name>
              <description>Transmission Occurred of Tx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO16" -->
            <field>
              <name>TO16</name>
              <description>Transmission Occurred of Tx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO15" -->
            <field>
              <name>TO15</name>
              <description>Transmission Occurred of Tx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO14" -->
            <field>
              <name>TO14</name>
              <description>Transmission Occurred of Tx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO13" -->
            <field>
              <name>TO13</name>
              <description>Transmission Occurred of Tx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO12" -->
            <field>
              <name>TO12</name>
              <description>Transmission Occurred of Tx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO11" -->
            <field>
              <name>TO11</name>
              <description>Transmission Occurred of Tx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO10" -->
            <field>
              <name>TO10</name>
              <description>Transmission Occurred of Tx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO9" -->
            <field>
              <name>TO9</name>
              <description>Transmission Occurred of Tx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO8" -->
            <field>
              <name>TO8</name>
              <description>Transmission Occurred of Tx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO7" -->
            <field>
              <name>TO7</name>
              <description>Transmission Occurred of Tx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO6" -->
            <field>
              <name>TO6</name>
              <description>Transmission Occurred of Tx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO5" -->
            <field>
              <name>TO5</name>
              <description>Transmission Occurred of Tx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO4" -->
            <field>
              <name>TO4</name>
              <description>Transmission Occurred of Tx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO3" -->
            <field>
              <name>TO3</name>
              <description>Transmission Occurred of Tx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO2" -->
            <field>
              <name>TO2</name>
              <description>Transmission Occurred of Tx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO1" -->
            <field>
              <name>TO1</name>
              <description>Transmission Occurred of Tx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO0" -->
            <field>
              <name>TO0</name>
              <description>Transmission Occurred of Tx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
