lkolbly/cmsis-svd/data/Cypress/S6E2D5.svd
        <!-- REGISTER "SDTIM" -->
        <register>
          <name>SDTIM</name>
          <description>SDRAM Timing Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00421141</resetValue>
          <resetMask>0x83FFFFF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BOFF" -->
            <field>
              <name>BOFF</name>
              <description>Buffer readout bit</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDPL" -->
            <field>
              <name>TDPL</name>
              <description>Data-in to Precharge Lead Time</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TREFC" -->
            <field>
              <name>TREFC</name>
              <description>Refresh Cycle time</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRAS" -->
            <field>
              <name>TRAS</name>
              <description>RAS active time</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRCD" -->
            <field>
              <name>TRCD</name>
              <description>RAS-CAS Delay</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description>RAS Precharge time</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRC" -->
            <field>
              <name>TRC</name>
              <description>RAS Cycle time</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CL" -->
            <field>
              <name>CL</name>
              <description>CAS Latency</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SDCMD" -->
        <register>
          <name>SDCMD</name>
          <description>SDRAM Command Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x801FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEND" -->
            <field>
              <name>PEND</name>
              <description>Pend</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDCKE" -->
            <field>
              <name>SDCKE</name>
              <description>SDRAM CKE</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCS" -->
            <field>
              <name>SDCS</name>
              <description>SDRAM Chip Select</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDRAS" -->
            <field>
              <name>SDRAS</name>
              <description>SDRAM RAS</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCAS" -->
            <field>
              <name>SDCAS</name>
              <description>SDRAM CAS</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDWE" -->
            <field>
              <name>SDWE</name>
              <description>SDRAM Write Enable</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDAD" -->
            <field>
              <name>SDAD</name>
              <description>SDRAM ADress</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>
